{
  "Web Development": [],
  "Introduction to Data Science": [],
  "Database Management System": [],
  "Internship ": [
    {
      "id": "101",
      "title": "Student Mental Health and Academic Stress Analysis Survey",
      "description": "This project surveys college students to understand the impact of academic stress on mental health, including exam pressure, sleep habits, and access to support systems. The results will help develop wellness strategies and promote awareness.",
      "tech_stack": "Google Forms, Python (Pandas, Matplotlib), Flask (for web app, optional)"
    },
    {
      "id": "102",
      "title": "Online Learning and Distance Learning Satisfaction Survey",
      "description": "The project evaluates student satisfaction with online and hybrid learning environments post-COVID. It gathers feedback on platform usability, learning effectiveness, and digital challenges faced.",
      "tech_stack": "Google Forms, MS Excel or Google Spreadsheet"
    },
    {
      "id": "103",
      "title": "Smart Feedback Analyzer for Online Learning Platforms",
      "description": "Use survey responses to rate and recommend e-learning platforms (Coursera, NPTEL, Udemy) based on student performance improvement and satisfaction.",
      "tech_stack": "Python (scikit-learn), Google Forms "
    },
    {
      "id": "104",
      "title": "Impact of Mobile Addiction on Academic and Social Life",
      "description": "Survey usage hours, preferred platforms, and effects on focus, health, and social interaction. Recommend digital detox plans.",
      "tech_stack": "Google Forms, Python (correlation analysis), Chart.js in Flask/React"
    }
  ],
  "MERN Stack": [
    {
      "id": "101",
      "title": "To-Do List App",
      "description": "A basic CRUD app where users can add, edit, mark as complete, and delete tasks. The backend exposes REST APIs for task management, and the frontend uses React to display and interact with the tasks in real time.",
      "tech_stack": "React, MongoDB, Node.js, Express.js, Axios"
    },
    {
      "id": "102",
      "title": "Notes Keeper",
      "description": "Users can create, search, and delete notes. Notes are stored in MongoDB and retrieved via an Express API. Great for learning state management and search filtering in React.",
      "tech_stack": "React, MongoDB, Node.js, Express.js"
    },
    {
      "id": "103",
      "title": "Expense Tracker",
      "description": "Users can add income and expense entries, filter by category/date, and see graphs of their spending habits. Focuses on MongoDB aggregations and chart rendering in React.",
      "tech_stack": "React, MongoDB, Node.js, Express.js"
    },
    {
      "id": "104",
      "title": "Book-Store",
      "description": "A digital library where users can browse, search, and save books. Optional admin panel for adding/removing books. Good for CRUD with search filtering.",
      "tech_stack": "React, MongoDB, Node.js, Express.js, Bootstrap"
    },
    {
      "id": "105",
      "title": "Event Booking System",
      "description": "Users can view upcoming events, book tickets, and see booking history. Admin can create and manage events.",
      "tech_stack": "React, MongoDB, Node.js, Express.js, Bootstrap"
    },
    {
      "id": "106",
      "title": "Restaurant Menu App",
      "description": "Display a restaurant menu, allow table booking or online ordering. Admin panel for updating menu items.",
      "tech_stack": "React, MongoDB, Node.js, Express.js, Tailwind CSS"
    }
  ]
}